// C 언어
// 1. 문법 학습
// 2. 다양한 프로그램 작성(프로젝트) ===> "만년달력", "테트리스 수준"
// 3. 자료구조와 알고리즘 
// 4. 다양한 프로그램 작성(프로젝트) ===> "좀더 수준높은 예제"




// C++에서 알아야 하는 것들

// 1. C보다 발전된 형태의 C++문법
//    => 함수 : overloading, template, inline, default parameter
//    => 변수 : auto
//    => 새로운 for, malloc 대신 new

// 2. 객체지향 문법 1. 한개의 클래스를 만들때 사용하는 문법들
// => private, public, protected
// => 생성자, 소멸자
// => 초기화 리스트

// => static member 
// => this 개념
// => const member function

// 3. 객체지향 문법 2. 상속관련
// => 상속에서의 생성자, 소멸자 호출원리
// => upcasting 과 virtual function 의 의미.(도형 편집기 예제)

// => 추상클래스, 인터페이스
// => OCP를 만족하게 설계 하라
// ====================================================
// ================> "디자인 패턴" 분야를 학습해 보세요.

// 4. 기타 문법 (연산자 재정의, 예외) - 지금 부터

// 5. C++ 표준 라이브러리 (STL) 사용법 - 내일

// 강사님 혹시 내일 시험 시간은 언제고, 혹시 오픈북일까요?
// => 4:50시 정도 부터 진행할 예정입니다.
// => 오픈북, 배운 소스 모두 보셔도 됩니다.
// => 개인 사정때문에 수업 불참하시는분은 4:40분까지만 zoom 접속해 주세요.
// => 20문항입니다 -  대부분 4지선다 + 2~3개정도 단답형. 